$(document).ready(function () {indexDict['zh-CHS'] = [{ "title" : "CODESYS IO-Link ", 
"url" : "_iolk_start_page.html", 
"breadcrumbs" : "CODESYS IO-Link \/ CODESYS IO-Link ", 
"snippet" : "有关设备编辑器的以下选项卡的信息，请参阅一般说明。 “<设备名称> I\/O 映射”选项卡 “<设备名称> IEC 对象”选项卡 “<设备名称> 参数”选项卡 “<设备名称> 状态”选项卡 “<设备名称> 信息”选项卡 相关设备编辑器的附加单独帮助页面仅在特殊功能的情况下可用。 如果未显示“<设备名称>参数”选项卡，则选择 显示通用设备配置编辑器 中的选项 CODESYS 选项，在 设备编辑器 类别。 IO-Link 是一种用于将智能传感器和执行器连接到自动化系统的通信系统。 IO-Link 系统由一个 IO-Link 主站组成，该主站为上级控制器 (PLC) 和一个或多个 IO-Link 设备...", 
"body" : "有关设备编辑器的以下选项卡的信息，请参阅一般说明。 “<设备名称> I\/O 映射”选项卡 “<设备名称> IEC 对象”选项卡 “<设备名称> 参数”选项卡 “<设备名称> 状态”选项卡 “<设备名称> 信息”选项卡 相关设备编辑器的附加单独帮助页面仅在特殊功能的情况下可用。 如果未显示“<设备名称>参数”选项卡，则选择 显示通用设备配置编辑器 中的选项 CODESYS 选项，在 设备编辑器 类别。 IO-Link 是一种用于将智能传感器和执行器连接到自动化系统的通信系统。 IO-Link 系统由一个 IO-Link 主站组成，该主站为上级控制器 (PLC) 和一个或多个 IO-Link 设备（传感器和执行器）提供接口。 在“设置设备”对话框中提供 IO-Link 模块之前，必须在设备存储库中安装相关的 IODD 设备描述文件。 有关更多信息，请参阅： “插入设备”命令 和 “设备存储库”命令 有关现场总线支持的更多一般信息，请参见  CODESYS ， 看： 现场总线支持 " }, 
{ "title" : "选项卡：IO-Link – IO-Link 设备信息 ", 
"url" : "_iolk_edt_device_info.html", 
"breadcrumbs" : "CODESYS IO-Link \/ 选项卡：IO-Link – IO-Link 设备信息 ", 
"snippet" : "对象：IO-Link 主站 IO-Link 模块的选项卡显示有关产品和设备供应商的各种信息。...", 
"body" : "对象：IO-Link 主站 IO-Link 模块的选项卡显示有关产品和设备供应商的各种信息。 " }, 
{ "title" : "选项卡：IO-Link – 参数 ", 
"url" : "_iolk_edt_parameter.html", 
"breadcrumbs" : "CODESYS IO-Link \/ 选项卡：IO-Link – 参数 ", 
"snippet" : "对象：IO-Link 主站 该选项卡可用于从 IO-Link 设备读取参数，对其进行修改，然后将其写回设备。功能范围取决于设备描述。按钮的命令也可在参数表中选定行的上下文菜单中使用。 用户角色 专家 维护 观察者 根据所选用户角色，表格中会显示更多或更少的参数详细信息。 识别菜单 有关设备标识的信息 参数菜单 显示设备的所有参数 诊断菜单 显示模块的错误消息（例如，电压错误） 观察菜单 显示观察消息（例如，“传感器脏”） 设置为默认值 将参数的在线值重置为设备描述中定义的默认值 阅读本页 从设备中读取当前显示的参数值并在表格中刷新 写这个页面 将当前显示的参数值写入 IO-Link 设备 保存...", 
"body" : "对象：IO-Link 主站 该选项卡可用于从 IO-Link 设备读取参数，对其进行修改，然后将其写回设备。功能范围取决于设备描述。按钮的命令也可在参数表中选定行的上下文菜单中使用。 用户角色 专家 维护 观察者 根据所选用户角色，表格中会显示更多或更少的参数详细信息。 识别菜单 有关设备标识的信息 参数菜单 显示设备的所有参数 诊断菜单 显示模块的错误消息（例如，电压错误） 观察菜单 显示观察消息（例如，“传感器脏”） 设置为默认值 将参数的在线值重置为设备描述中定义的默认值 阅读本页 从设备中读取当前显示的参数值并在表格中刷新 写这个页面 将当前显示的参数值写入 IO-Link 设备 保存在线值 应用当前显示的 在线价值 到 价值 柱子 恢复值 应用来自 价值 列到 在线价值 柱子 该表根据设置的用户角色和选择的菜单列出了不同的参数（名称）和参数详细信息。 姓名 参数名称 价值 当前有效的参数值显示在 价值 柱子。 在线价值 这 在线价值 仅当设备支持参数下载并且配置编辑器中显示的参数在设备上也可用时，才会显示列。 您可以更改此列中的参数值并将其传输到设备 写这个页面 命令，无需修改项目，也无需下载新的应用程序。随着 保存在线值 命令，可以将当前在线值保存为 价值 . 读\/写 参数值的权限 ( ro ： 只读; rw ： 读和写） " }
]
$(document).trigger('search.ready');
});