$(document).ready(function () {indexDict['ja'] = [{ "title" : "CODESYS IO-Link ", 
"url" : "_iolk_start_page.html", 
"breadcrumbs" : "CODESYS IO-Link \/ CODESYS IO-Link ", 
"snippet" : "デバイスエディタの次のタブについては、一般的な説明を参照してください。 '<デバイス名> I \/ Oマッピング'タブ '<デバイス名> IECオブジェクト'タブ '<デバイス名>パラメータ'タブ '<デバイス名>ステータス'タブ '<デバイス名>情報'タブ 関連するデバイスエディタ用の追加の個別のヘルプページは、特別な機能の場合にのみ使用できます。 「<デバイス名>パラメータ」タブが表示されない場合は、 一般的なデバイス構成エディターを表示する のオプション CODESYS オプション、 デバイスエディタ カテゴリー。 IO-Linkは、インテリジェントセンサーとアクチュエーターを自動化システ...", 
"body" : "デバイスエディタの次のタブについては、一般的な説明を参照してください。 '<デバイス名> I \/ Oマッピング'タブ '<デバイス名> IECオブジェクト'タブ '<デバイス名>パラメータ'タブ '<デバイス名>ステータス'タブ '<デバイス名>情報'タブ 関連するデバイスエディタ用の追加の個別のヘルプページは、特別な機能の場合にのみ使用できます。 「<デバイス名>パラメータ」タブが表示されない場合は、 一般的なデバイス構成エディターを表示する のオプション CODESYS オプション、 デバイスエディタ カテゴリー。 IO-Linkは、インテリジェントセンサーとアクチュエーターを自動化システムにリンクするための通信システムです。 IO-Linkシステムは、上位コントローラー（PLC）と1つ以上のIO-Linkデバイス（センサーとアクチュエーター）へのインターフェイスを提供するIO-Linkマスターで構成されます。 [デバイスの設定]ダイアログでIO-Linkモジュールを使用する前に、関連するIODDデバイス記述ファイルをデバイスリポジトリにインストールする必要があります。 詳細については、以下を参照してください。 「プラグデバイス」コマンド と 「デバイスリポジトリ」コマンド フィールドバスのサポートに関する一般的な情報については、 CODESYS 、 見る： フィールドバスのサポート " }, 
{ "title" : "タブ：IO-Link –IO-Linkデバイス情報 ", 
"url" : "_iolk_edt_device_info.html", 
"breadcrumbs" : "CODESYS IO-Link \/ タブ：IO-Link –IO-Linkデバイス情報 ", 
"snippet" : "オブジェクト：IO-Linkマスター IO-Linkモジュールのタブには、デバイスの製品とベンダーに関するさまざまな情報が表示されます。...", 
"body" : "オブジェクト：IO-Linkマスター IO-Linkモジュールのタブには、デバイスの製品とベンダーに関するさまざまな情報が表示されます。 " }, 
{ "title" : "タブ：IO-Link –パラメータ ", 
"url" : "_iolk_edt_parameter.html", 
"breadcrumbs" : "CODESYS IO-Link \/ タブ：IO-Link –パラメータ ", 
"snippet" : "オブジェクト：IO-Linkマスター このタブを使用して、IO-Link デバイスからパラメータを読み取り、変更してデバイスに書き戻すことができます。機能の範囲は、デバイスの説明によって異なります。ボタンのコマンドは、パラメータ テーブルで選択した行のコンテキスト メニューでも使用できます。 ユーザーロール スペシャリスト メンテナンス 観察者 選択したユーザーロールに応じて、パラメーターの詳細が表に表示されます。 識別メニュー デバイスの識別に関する情報 パラメータメニュー デバイスのすべてのパラメータを表示します 診断メニュー モジュールのエラーメッセージを表示します（電圧エラーなど） 観...", 
"body" : "オブジェクト：IO-Linkマスター このタブを使用して、IO-Link デバイスからパラメータを読み取り、変更してデバイスに書き戻すことができます。機能の範囲は、デバイスの説明によって異なります。ボタンのコマンドは、パラメータ テーブルで選択した行のコンテキスト メニューでも使用できます。 ユーザーロール スペシャリスト メンテナンス 観察者 選択したユーザーロールに応じて、パラメーターの詳細が表に表示されます。 識別メニュー デバイスの識別に関する情報 パラメータメニュー デバイスのすべてのパラメータを表示します 診断メニュー モジュールのエラーメッセージを表示します（電圧エラーなど） 観察メニュー 観測メッセージを表示します (たとえば、「センサーが汚れています」)。 デフォルトに設定 パラメータのオンライン値を、デバイス記述で定義されているデフォルト値にリセットします このページを読む パラメータの現在表示されている値をデバイスから読み取り、テーブルで更新します このページを書く パラメータの現在表示されている値をIO-Linkデバイスに書き込みます オンライン値を保存 現在表示されている オンラインの価値 に 価値 桁 値を復元する からの値を適用します 価値 への列 オンラインの価値 桁 テーブルには、設定されたユーザー ロールと選択したメニューに応じて、さまざまなパラメーター (名前) とパラメーターの詳細が一覧表示されます。 名前 パラメータ名 価値 現在有効なパラメータ値が 価値 桁。 オンラインの価値 の オンラインの価値 列は、デバイスがパラメーターのダウンロードをサポートし、構成エディターに表示されるパラメーターがデバイスでも使用できる場合にのみ表示されます。 この列のパラメータ値を変更して、デバイスに転送できます。 このページを書く プロジェクトを変更せず、新しいアプリケーションをダウンロードする必要もありません。とともに オンライン値を保存 コマンドを使用すると、現在のオンライン値を 価値 . r\/w パラメーター値に対するアクセス許可 ( ro : 読み取り専用; rw ： 読み書き） " }
]
$(document).trigger('search.ready');
});